---
kind: type
id: T:Autodesk.Revit.DB.LocationCurve
source: html/9dd6eb99-f105-a05f-dc1b-dfde17b8768c.htm
---
# Autodesk.Revit.DB.LocationCurve

Provides location functionality for all elements that are based upon a curve.

## Syntax (C#)
```csharp
public class LocationCurve : Location
```

## Remarks
The location line objects adds additional functionality to its base location object
class. This includes reading and writing the curve contained within the element.